[
  {
    "heading": "Congratulations to our showcase winners!",
    "body": "Dear class,\n\nI hope finals are treating you well. :) As we process final grades, I wanted to share a final thank you for a wonderful semester - I know that I can speak on behalf of our faculty and TAs when I express how much we fun we had learning alongside you all this spring. Thank you for all of your time and effort! \n\nPlease join me as well in congratulating our Gunter Georgi and Nick Russo Award winners for this spring.\n\nGunter Georgi\n\nHIR: Skyline Builders and Innovation (Section A2) -  Veer Choksi, Arda Dinc, and Jomyuth Luangtana-anan\nRAD: RoboCaddy (Section E2) - Alex Huang, Jack Li, Samarth Pusegaonkar, and Jason Tung\nVEX MRR: Top Dog Robotics (Section F3) - George Chorny, Jeremiah Duran, Justin Sun, and Alan Zhang\nVEX LAZ: SAI LLC (Section G2) - Irika Aggarwal, Ishraq Basher, Sarah Niu, and Aksana Rodshi\n\nNick Russo\nHIR:  Etchasia Rayboah Innovations (Section B1) - Anastasia Cruz, Indi Etchebarne, Raymond Li, and Blessing Yeboah\nRAD: Code Blocks (Section E3) - Bill Li, Mitsuki Nakajima, and Dwayne Ong \n\nHappy summer,\n\nProf. Paredes",
    "footer": "May 13, 2024 at 10:51 AM"
  },
  {
    "heading": "Last Day of Open Lab",
    "body": "Hello all!\n\nThis week if the final week of Open Lab and it will close at 6:00 p.m. on May 3rd. If you do not return your kit by this deadline, you will receive a grade of \"I\" in the gradebook. \n\nGood luck to those of you who are participating in the showcase and good luck with finals!",
    "footer": "April 29, 2024 at 11:00 AM"
  },
  {
    "heading": "The RAD Showcase is TODAY at 12:30pm!",
    "body": "Dear class,\n\nHappy Monday! \n\nIf you are available, please join us in Pfizer Auditorium today at 12:30 PM to watch the final round of the RAD Showcase! Six teams will present their work and compete for the Gunter Georgi Award. All are welcome to attend!\n\nBest,\n\nProf. Paredes",
    "footer": "April 29, 2024 at 10:23 AM"
  },
  {
    "heading": "RAD Kit Returns!",
    "body": "Hey all,\n\nThe Open Lab (JABS 573) will be open for kit returns from  4/22 -5/3. Failure to return your kit will result in a grade of I (Incomplete) in EG-UY 1004: Introduction to Engineering and Design. If the I (Incomplete) is not resolved in a timely manner, the grade will convert to an F (Fail). If you have returned your kit, please disregard this message. Also as a reminder: If any RAD groups would like to continue their projects past this semester and keep any materials, you will have to submit this form.\n\nHope everyone had a great semester with the EG1004 team and good luck with finals!",
    "footer": "April 25, 2024 at 01:07 PM"
  },
  {
    "heading": "DEADLINE EXTENDED Keep Working On Your RAD Project",
    "body": "To All RAD groups,\n\nIn light of the semester coming to a close, we wanted to encourage students to carry on their projects even after they have completed EG 1004. If a group wants to continue their project after the end of the semester and retain ownership of their prototype, they can fill out this form. Completion of this form doesn't guarantee that the group will get to keep the project. The final decision is made by EG 1004 administration. The deadline for completion is this Saturday 4/27.\n\nGood luck to everyone this submission week!",
    "footer": "April 23, 2024 at 12:06 PM"
  },
  {
    "heading": "Apply to be a TA!",
    "body": "Dear EG 1004 Students!\n\nAs we mentioned in lecture and recitation, we are now hiring TAs for future semesters of EG 1004 (starting Fall 2024). We are looking for enthusiastic TAs who are passionate about shaping future STEM professionals. The application can be found at https://eg.poly.edu/apply .\n\nWe are excited about your interest in making EG 1004 the best possible course for incoming first-year students at Tandon. Applications are open until 11:59 PM EDT on May 15, 2023. The interviews are expected to take place virtually over the summer. If you have any questions regarding the position or the process, feel free to reach out to your Teaching Assistants, Professors, or Head Teaching Assistants at eg1004@eg.poly.edu . Have a good semester!",
    "footer": "April 22, 2024 at 11:18 AM"
  },
  {
    "heading": "RSVP to the SLDP Showcase!",
    "body": "Dear class,\n\nCome support your peers at the SLDP Showcase on Monday, April 22, from 12:30 - 2 PM in JAB573! We have an exciting lineup of 27 teams across SLDPs - HIR, RAD, and VEX - ready to present posters and demonstrations of their work, and compete for our Gunter Georgi and Nick Russo Awards.\n\nRSVP: https://lu.ma/j9mz3aw6\nLight refreshments will be served.",
    "footer": "April 16, 2024 at 12:44 PM"
  },
  {
    "heading": "Upcoming Tandon Career Hub Event",
    "body": "Dear EG students, \n\nPlease see the below event from Tandon Career Hub.\n\n===\n\nDear CBE students,\n\nWe are excited to announce that on Tuesday, April 23rd, NYU Tandon Career Hub x CBE Department will be hosting a CBE Alumni Panel + Networking Session. We are happy to welcome back several CBE alumni, who will share their experiences in graduate school, job searching, industry, and more. After the panel, you will also get a chance to ask each alum your own questions and build your network!Participating alumni come from various industries– like Oil & Gas, Pharmaceuticals, and Cosmetics– providing unique perspectives on CBE-related fields and potential career paths available to you. Our alumni panelists are below and you can read their bios here:\n\nAbdullah Sayed: Senior Implementation Lead, Xeal\nCheuryon John: Engineer, Drug Product Innovation\nDiya Mulay: Associate Engineer, Estee Lauder\nFariha Mahjabin: Energy Market Analyst, Enersponse LLC\nIqra Mirza: Project Engineer II, PowerFlex\nJakub Legocki: Associate Scientist, Merck\n\nPlease see details and registration information below.\n\n\nEvent Details\nDate: Tuesday, April 23rd, 2024\nTime: 6 PM\nLocation: 370 Jay Street, #1201\nFood will be provided.\nRegister here by April 16th.",
    "footer": "April 12, 2024 at 10:33 AM"
  },
  {
    "heading": "Lecture 10 Attendance Issue",
    "body": "Dear class,\n\nI hope this email finds you well. Our team is aware that many of you are missing attendance for Lecture 10 from the gradebook. We are working to resolve this issue and will provide you all with an update soon.\n\nBest,\n\nProf. Paredes",
    "footer": "April 10, 2024 at 09:05 PM"
  },
  {
    "heading": "Earth Day Celebration with Sustainable Engineering Initiative",
    "body": "Dear class, \n\nPlease see below for an invitation to Earth Day programming at Tandon from the Sustainable Engineering Initiative, led by Prof. Modestino in CBE who delivered lecture a few weeks ago. I am part of the planning committee of this event as well - I hope to see you there! :D\n===\n\nCelebrate Earth Day with the Sustainable Engineering Initiative! On Monday, 4/22, visit our Climate Cafe in the MakerSpace EventSpace and Foyer. From 5-7 PM, we’ll have:\n\n• Poster presentations and teach talks about sustainability education efforts at Tandon\n\n• Sustainability bingo hosted by TUSC\n\n• Opportunities to share your experience with sustainability education at our school \n\n• Raffles for prizes!\n\nLight refreshments will be served. RSVP at this link: https://lu.ma/vwt5fi37",
    "footer": "April 8, 2024 at 02:55 PM"
  },
  {
    "heading": "Showcase Application Deadline & Clarification",
    "body": "Hi class,\n\nThe deadline to apply to the SLDP Showcase is TONIGHT! To apply, please provide this information using this application form by Thursday, April 4, 2024 at 11:59 PM ET. Teams will receive confirmation from our team by Friday, April 5, 2024 at 5 PM ET.\n\nI also wanted to clarify expectations for the poster and printing. Approved teams will digitally design the posters (36 x 48) in software/websites like PowerPoint or Canva and submit a pdf to our team, which we will print on your behalf -- there is no expectation for teams to spend money on materials or printing costs.\n\nIf you have any further questions or concerns, please don't hesitate to reach out!\n\nBest,\n\nProf. Paredes",
    "footer": "April 4, 2024 at 11:04 AM"
  },
  {
    "heading": "DEADLINE EXTENDED: Apply to the SLDP Showcase!",
    "body": "Dear class,\n\nHope you are staying dry today! As your recitation instructors may have mentioned today, we are extending the SLDP showcase deadline to Thursday, April 4, at 11:59 PM ET. Information about the showcase and application process can be found below. Please reach out to your recitation instructors in case you have any questions or concerns about the application. We look forward to reviewing them! :)\n\n- Prof. Paredes\n\n==\n\nDear class,\n\nOur program is happy to announce the inaugural EG-1004 SLDP Showcase! Join us for a series of events that will celebrate your work and provide an opportunity for you to network with other students, faculty, and staff at Tandon.\n\nThe showcase will entail two rounds. In the first, qualifying round, teams will present posters and the physical prototypes of their work. A select number of teams will proceed to the second, final round, in which teams will present oral presentations of their projects. \n\nFinalists will have the opportunity to compete for our first place award, the Gunter Georgi Award, and second place award, the Nick Russo Award. These awards, named after the educators who established our course, celebrate excellence in design, innovation, and entrepreneurship. Recipients of the Nick Russo Award will receive $100 per team member. Recipients of the Gunter Georgi Award will receive $200 per team member and the opportunity to present their work to incoming first-year students at 2025 Convocation.\n\nDue to limited time and space, participation in the SLDP showcase requires an application from all interested SLDP teams. For all SLDPs (HIR, RAD, LAZ, and MRR), the application requires:\n\nSuccessful completion of Benchmark B\n\nCAD renderings of your design in Fusion 360/Revit\n\nA draft or copy of your Milestone 3 Presentation \n\nPhotos and/or videos of your project, if available\n\nResponses to a series of short-answer questions in the application form linked below\n\nTo apply, please provide this information using this application form by Thursday, April 4, 2024 at 11:59 PM ET.  Teams will receive confirmation from our team by Friday, April 5, 2024 at 5 PM ET.\n\nYou may view this announcement here as well for your convenience.",
    "footer": "April 2, 2024 at 02:22 PM"
  },
  {
    "heading": "NYU Climate and Sustainability Opinion Essay Competition",
    "body": "Dear class,\n\nPlease see below for writing opportunity from the Expository Writing Program and NYU Office of Sustainability. If you have any questions, please e-mail Prof. Abby Rabinowitz at afr229@nyu.edu.\n\nBest,\n\nProf. Paredes\n\n===\n\nYou're invited to participate in the NYU Climate and Sustainability Opinion Essay Competition, hosted by the Expository Writing Program with support from NYU's Office of Sustainability. The competition deadline is Friday April 12, 11:59 p.m. Please visit this website for details: https://cas.nyu.edu/ewp/ewp-courses/Tandon/nyu-climate-and-sustainability-opinion-essay-competition.html\n\nWinners will receive prizes, along with a chance to speak with an editor or writer committed to publishing on climate change, and to read their work at an NYU event to-be-announced. The competition is open to all enrolled NYU students, with three of the six prizes reserved for undergraduate entrants.To help writers prepare, EWP is hosting a free climate op-ed writing workshop on Wed. March 27 at 5 p.m. at this zoom link: https://nyu.zoom.us/j/94765904650  You're welcome to join!Of course, please let me know if you have any questions.\n\nAll the best,\n\nProfessor Rabinowitz",
    "footer": "March 27, 2024 at 09:36 AM"
  },
  {
    "heading": "Apply to the SLDP showcase!",
    "body": "Dear class,\n\nOur program is happy to announce the inaugural EG-1004 SLDP Showcase! Join us for a series of events that will celebrate your work and provide an opportunity for you to network with other students, faculty, and staff at Tandon.\n\nThe showcase will entail two rounds. In the first, qualifying round, teams will present posters and the physical prototypes of their work. A select number of teams will proceed to the second, final round, in which teams will present oral presentations of their projects. \n\nFinalists will have the opportunity to compete for our first place award, the Gunter Georgi Award, and second place award, the Nick Russo Award. These awards, named after the educators who established our course, celebrate excellence in design, innovation, and entrepreneurship. Recipients of the Nick Russo Award will receive $100 per team member. Recipients of the Gunter Georgi Award will receive $200 per team member and the opportunity to present their work to incoming first-year students at 2025 Convocation.\n\nDue to limited time and space, participation in the SLDP showcase requires an application from all interested SLDP teams. For all SLDPs (HIR, RAD, LAZ, and MRR), the application requires:\n\nSuccessful completion of Benchmark B\n\nCAD renderings of your design in Fusion 360/Revit\n\nA draft or copy of your Milestone 3 Presentation \n\nPhotos and/or videos of your project, if available\n\nResponses to a series of short-answer questions in the application form linked below\n\nTo apply, please provide this information using this application form by Tuesday, April 2, 2024 at 11:59 PM ET.  Teams will receive confirmation from our team by Friday, April 5, 2024 at 5 PM ET.\n\nYou may view this announcement here as well for your convenience.",
    "footer": "March 26, 2024 at 01:25 PM"
  },
  {
    "heading": "Lecture 8 Slides Uploaded + Weekly Announcements",
    "body": "Dear class,\n\nI missed you all today! I hope you had a restful spring break and enjoyed the lecture today from the Office of Sustainability and Sustainable Engineering Initiative. You can now find today's slides uploaded under the \"Lecture\" tab. A couple of announcements:\n\nThis week in lab, you will have a Model Shop Session -- essentially time to work on your SLDPs with the guidance of our TAs. Benchmark B will be due at the end of this session and as usual for lab, attendance is mandatory! Please make sure to tap in and out to ensure we have a proper record of your attendance.\nSLDP Showcase Applications will be released tomorrow! Keep an eye out in your inboxes.\nThank you those of you who have already filled out the Mid-semester Course Feedback for our course. If you have not yet done so, please, please fill out the survey by tonight at 11:59 PM ET! The invitation should be in your inbox. Our faculty use this feedback to make improvements to our course, both during and between semesters. We truly appreciate your feedback.\n\nSee you next week,\n\nProf. Paredes",
    "footer": "March 25, 2024 at 02:30 PM"
  },
  {
    "heading": "Lecture 7 Slides Uploaded + Weekly Announcements",
    "body": "Hi everyone!\n\nYou can now find today's slides uploaded under the \"Lecture\" tab. A couple of other announcements:\n\nThere will be no class next week. Happy spring break!\nOpen Lab (JAB573) will be open on a modified schedule. Please refer to the \"Syllabus/Schedules\" page for operating hours.\nRevit 2024 is now available in Open Lab - thank you to our Systems Administration team for taking care of this! \nSLDP Showcase applications will be released around Benchmark B. I will include details in a separate announcement, but in the meantime, please reach out to me and your recitation instructors if you have any questions. We encourage everyone to apply!\n\nThanks and have a great week! See you soon,\n\nProf. Paredes\n\n ",
    "footer": "March 12, 2024 at 01:54 PM"
  },
  {
    "heading": "Apply for RAD Innovation Grant!",
    "body": "Hi everyone!\n\nAs mentioned in lecture, applications are now open for the RAD Innovation Grant. Open to all RAD groups, this grant can supplement your $100 budget to purchase items for completion of your projects.\n\nIf you have questions or concerns, please contact your recitation instructors. The application deadline is 03/31/24 at 11:59 PM ET.\n\nGood luck on your projects!",
    "footer": "March 11, 2024 at 01:59 PM"
  },
  {
    "heading": "Lecture 6 Slides Uploaded + Weekly Announcements",
    "body": "Hi class!\n\nYou can now find today's slides uploaded under the \"Lecture\" tab. A couple of other announcements:\n\nMilestone 2 is this week! Good luck!\nThe Lab 2 Rewrite and Lab 7 Individual Report are extra credit opportunities that will replace the lower of your Lab 2 and Lab 3 grades, respectively. If you have any questions about this, please reach out to your recitation instructors.\n\nThanks and have a great week! See you soon,\n\nProf. Paredes",
    "footer": "March 4, 2024 at 05:54 PM"
  },
  {
    "heading": "Open Lab and Proto Lab Closure",
    "body": "Hi all!\n\n\nThe Open Lab and Proto Lab will be closed during Lab sections E, F and G (2:00-5:00 pm) between 2/27 and 3/01. These changes are updated on the Open Lab Schedule on the EG website.\n\nBest,\nThe General Engineering Team",
    "footer": "February 27, 2024 at 01:09 PM"
  },
  {
    "heading": "Gen 1 Airpods Left in Pfizer - 2/26/24",
    "body": "Hi class,\n\nWe found a pair of gen 1 airpods today on the floor of Pfizer. If you are missing them, please e-mail me (ijparedes@nyu.edu) to coordinate pickup.\n\nIngrid",
    "footer": "February 26, 2024 at 03:35 PM"
  },
  {
    "heading": "Lecture 5 Slides Uploaded + Weekly Announcements",
    "body": "Hi class!\n\nYou can now find today's slides uploaded under the \"Lecture\" tab. A couple of other announcements:\n\nYou all should have completed MakerSpace training! If you have not yet, or have any questions/concerns about the training, please reach out to your recitation instructors. \nThis week in lab, you will have Model Shop Session 2 -- essentially time to work on your SLDPs with the guidance of our TAs. Benchmark A will be due at the end of this session and as usual for lab, attendance is mandatory!\n\nThanks and have a great week! See you soon,\n\nProf. Paredes",
    "footer": "February 26, 2024 at 01:35 PM"
  },
  {
    "heading": "Reminder: MakerSpace Training Deadline for E, F, & G",
    "body": "Hi all,\n\nApologies for forgetting to send this out last week due to the snowstorm! For all students in groups E, F, and G (Sections E1, E2, E3, F1, F2, F3, and G1, G2, and G3), a reminder to please complete your MakerSpace orientation training by Friday, 2/23/24. The schedule for trainings can be found at https://makerspace.engineering.nyu.edu/.\n\nFor all other EG students, if you have not yet completed your training, please do so by no later than your Lab 6 session (Modelshop 2). If you are unable to schedule an appointment by that date, please reach out to your recitation instructors. \n\nThank you,\n\nProf. Paredes",
    "footer": "February 21, 2024 at 01:31 PM"
  },
  {
    "heading": "Open Lab Schedule Reminder",
    "body": "Hi all!\n\n \n\nHope the long weekend is treating you well. Despite the holiday this Monday, February 19th, Modelshop (JABS 573) will be open following the regular schedule posted on the website! \n\n \n\nBest,\n\nThe General Engineering Team",
    "footer": "February 18, 2024 at 12:39 PM"
  },
  {
    "heading": "Inclement Weather Plans for Tuesday, 2/13",
    "body": "Hi everyone,\n\nIn line with the university's guidance, please note the following changes to course operations for tomorrow, Tuesday, 2/13.\n\nRecitations for sections C1, C2, C3 and F1, F2, and F3 will be held remotely. Your recitation instructors will provide a Zoom link ahead of class time. Please sign in on time for class and be prepared to present your lab 3 presentations virtually with your teammates. As usual, if for any reason you are unable to attend class tomorrow, please e-mail your recitation instructors ahead of time.\nEG Lab will be canceled for tomorrow. Sections A1, A2, A3 and E1, E2, and E3, please submit a Makeup Lab Request for Lab 4: Model Shop Session 1.\nYour recitation instructors will approve the request once received. Note that Lab 4's sessions are introductory workshops for your projects, and you will receive important project information and materials during the makeup session.\nIf you planned to meet your RAD mentor during this time, please coordinate with them to either meet remotely or reschedule to a later date.\nOpen Lab will be closed tomorrow.\n\nWe will provide another update tomorrow regarding Wednesday's course operations, pending on the weather. In the meantime, if you have any questions or concerns, please reach out to your recitation instructors and cc me (ijparedes@nyu.edu).\n\nThank you, and stay safe!",
    "footer": "February 12, 2024 at 04:31 PM"
  },
  {
    "heading": "Modelshop Closing Reminder",
    "body": "Hi all!\n\n \n\nModelshop will be closed during Lab sections E, F and G (2:00-5:00 pm) between 2/13 and 2/16. These changes are updated on the Open Lab Schedule on the EG website.\n\n \n\nBest,\n\nThe General Engineering Team",
    "footer": "February 12, 2024 at 02:24 PM"
  },
  {
    "heading": "Items Left in Pfizer - 2/5/24",
    "body": "Hi class,\n\nI picked up a pair of AirPods and a winter hat from the first row of Pfizer today. If you left either of these items behind, please e-mail me at ijparedes@nyu.edu so we can coordinate a pick up time. I will also be in my office (RH305D) until 5 PM today.\n\nBest,\n\nProf. Paredes",
    "footer": "February 5, 2024 at 03:55 PM"
  },
  {
    "heading": "Lecture 3 Slides Uploaded + Weekly Announcements",
    "body": "Hi class!\n\nYou can now find today's slides uploaded under the \"Lecture\" tab. A couple of other announcements:\n\nStudents in Groups C + D (Sections C1, C2, and C3, and D1, D2 and D3), please complete your MakerSpace training by Friday, 2/9! If you are unable to schedule a training by this deadline, please schedule one at your earliest convenience and inform your recitation instructors.\nSLDP applications are due tonight at 11:59 PM! If you have any questions, please reach out to your recitation instructors. Open Lab will be open until 8PM tonight for RAD ideation sessions.\nThis week in lab, you will complete Lab 3: Prototyping a Thermal Insulation Device with Microcontrollers - again, please review the manual page for Lab 3 ahead of your lab session; this information will help prepare you and your teammates, and be the basis of the quiz you will take at the start of the session.\n\nThanks and have a great week! See you soon,\n\nProf. Paredes",
    "footer": "February 5, 2024 at 03:47 PM"
  },
  {
    "heading": "SLDP Application Final Reminder",
    "body": "Good Morning students!\n\n \n\nJust a reminder to fill out the SLDP Application using this form, due tonight at 11:59 pm. If you are applying for RAD, make sure to attend a RAD ideation session in Open Lab (JABS 573), open till 8:00 pm today. \n\n \n\nBest,\n\nThe General Engineering Team",
    "footer": "February 5, 2024 at 11:04 AM"
  },
  {
    "heading": "RAD Ideation Sessions",
    "body": "Good Afternoon EG1004 Students!\n\n \n\nThis is a general reminder that any SLDP groups interested in applying to RAD MUST attend a RAD Ideation session in the Open Lab (JABS 573) in order to submit their application. This application is due Monday, February 5th @ 11:59 PM. The Open Lab schedule is available under the Syllabus/Schedules Tab of the Course Information menu on the website. We encourage you to go and ideate as soon as possible to develop well thought out ideas and for ample time to fill out the application!\n\n \n\nBest,\n\nThe General Engineering Team",
    "footer": "February 2, 2024 at 12:57 PM"
  },
  {
    "heading": "Updates to Housing & Innovation in Revit (HIR)",
    "body": "Good morning EG!\n\nI hope your weeks are going well. :) For our HIR teams, please note that we are currently updating the manual and presentations with project information and up-to-date requirements, as mentioned in lecture. The pages will be updated today. If you have any questions or concerns, please reach out to your recitation instructors and research@eg.poly.edu.\n\nThank you,\n\nProf. Paredes",
    "footer": "February 1, 2024 at 08:29 AM"
  },
  {
    "heading": "Lecture 2 Slides Uploaded + Weekly Announcements",
    "body": "Hi class!\n\nYou can now find today's slides uploaded under the \"Lecture\" tab. A couple of other announcements:\n\nStudents in Groups A + B (Sections A1, 2, and 3, and B1, 2 and 3), please complete your MakerSpace training by Friday, 2/2! If you are unable to schedule a training by this deadline, please schedule one at your earliest convenience and inform your recitation instructors.\nThis week in recitation, you will form groups for your SLDP. Please review the manual for information about your project options; your recitation instructors will also provide information in class tomorrow before you form teams.\nThis week in lab, you will complete Lab 2: CAD Competition - again, please review the manual page for Lab 2 ahead of your lab session; this information will help prepare you and your teammates, and be the basis of the quiz you will take at the start of the session.\n\nThanks and have a great week! See you soon,\n\nProf. Paredes",
    "footer": "January 29, 2024 at 10:08 PM"
  },
  {
    "heading": "Have a Fusion 360 Account",
    "body": "Hi everyone,\n\nAs was discussed in lecture today, this week's lab (Lab 2) will be a competition using Autodesk Fusion 360. By the time you arrive in lab this week, your recitation instructors will have added you to our institutional license for the software.\n\nPlease set up your account prior to your lab session this week. Doing so will save you, your lab partners, and TAs time! If you have any questions, please reach out to your recitation instructors. Thanks and good luck with the competition!",
    "footer": "January 29, 2024 at 02:41 PM"
  },
  {
    "heading": "SLDP Application",
    "body": "Hello All,\n\nHere is the application form for your SLDP projects (RAD, VEX, and HIR). Please only fill out the application once you have formed your SLDP groups in recitation. The form is due by next Monday (02/05) 11:59PM EST.\n\nIf you are applying for RAD, your group will need to attend Open Lab and meet with a TA for a RAD ideation session. If you are first applying for VEX or HIR, but RAD is your second choice, you are highly encouraged to attend an ideation session! Open Lab times can be found on the EG website. Please contact your recitation TA if you have any questions!\n\nIf you need help finding inspiration for RAD project ideas, you can reference this document.\n\nGood luck to everyone!",
    "footer": "January 29, 2024 at 12:22 PM"
  },
  {
    "heading": "Lecture 1 Slides Uploaded",
    "body": "Hi everyone,\n\nIt was nice to meet you all today! You can now find today's slides under the \"Lecture\" tab. If you have any questions or concerns, please feel free to reach out. Have a great week!\n\n- Prof. Paredes",
    "footer": "January 22, 2024 at 04:23 PM"
  },
  {
    "heading": "Welcome Students!",
    "body": "Hello Everyone,\n\nFor staffing information for the course you may click on \"Sections\" found on the left menu portion of this webpage under the \"Course Information\" heading. Room numbers for recitations, labs, and lecture can also be found on this page. You may familiarize yourselves with all of the EG1004 TAs by clicking on \"Teaching Assistants\" and looking up your TAs by name. You may also search for your professors and writing consultants by clicking on \"Professors\" or \"Writing Consultants\".\n\nYou can view the syllabus and schedule from the the left menu portion of the webpage.\n\nIf you have any further questions regarding the course, assignments, staffing, or anything else you may direct them to gecentral@eg.poly.edu. Have a wonderful semester!\n\n- The General Engineering Team",
    "footer": "January 22, 2024 at 04:08 PM"
  }
]